
// რა არის useEffect და რისთვის ვიყენებთ მას React-ში?

// useEffect react-ში არის eventListener-ის სავით, იგი მეთვალყურეობს, უთვალთვალებს და აკვირდება მოვლენას, როცა რაღაც უნდა გაკეთდეს კომპონენტის რენდერის შემდეგ.


// როდის შესრულდება useEffect-ის შიგნით დაწერილი კოდი?

// useEffect-ში არსებული ფუნქცია ყოველთვის render-ის შემდეგ სრულდება. ჯერ დარენდერდება კომპონენტი და შემდეგ იმოქმედებს useEffect-ში გაწერილი მოქმედება


// რისთვის ვიყენებთ მეორე არგუმენტს useEffect(() => {}, [])?

// მეორე არგუმენტი არის სია, რომელშიც გადავცემთ ელემენტის state-ებს, რომელი ელემენტების state-ის შეცვლაზე მოხდეს ესა თუ ის მოვლენა, როდესაც useEffect უთვალთვალებს მას.