// 1) ახსენით რა არის props? რაში გვეხმარება იგი? რატომ არის კარგი პრაქტიკა, რომ ერთსა და იმავე კომპონენტს სხვადასხვა მონაცემები გადავცეთ?

// props საშუალებას გვაძლევს გადავცეთ მონაცემები კომპონენტებს. ეს არის გზა, რომლითაც მშობელი კომპონენტი შვილს აწვდის კონკრეტულ ინფორმაციას

// ახსენით რა განსხვავებაა HTML ატრიბუტებსა და React props ებს შორის

// html ატრიბუტებსა და react props შორის არის რამდენიმე მნიშვნელოვანი განსხვავება, მაგალითად უპირველესყოვლისა სინტაქსში, გამოყენების ადგილში და რა თქმა უნდა მის შემდეგ დამუშავებაში და გამოსახვაში

