
// 1) რა განსხვავებაა input-ის value და placeholder-ს შორის?

// placeholder უბრალოდ მიგვითითებს თუ რა ტიპის ინფორმაცია უნდა ჩავწეროთ ამ თუ იმ input-ში, ხოლო value კი ადგენს მის საწყისს მნიშვნელობას, ანუ როგორი მნიშვნელობა იქნება საწყისად input-ში


// 2) რას აკეთებს onChange ფუნქცია?

// onChange - ნიშნავს შეცვლისას და მუშაობს როდესაც ჩვენი მნიშბელობის ან ელემენტის შიგთავსი იცვლება და ეს ფუნქცია ავტომატურად ანახლებს მას


// 3) როგორ შეგვიძლია ვაკონტროლოთ input-ის მნიშვნელობა React-ში?

// input-ის მნიშნელობა react-ში შეგვიძლია ვაკონტროლოთ useState-ის, value-ს, onChange-ს და შესაბამისი ცვლილების ფუნქციის დახმარებით, რომელიც გვეხმარება input-ის მნიშვნელობის ცვლილებაში.