
// git არის პროგრამა რომელიც საშუალებას გვაძლევს სხვა პიროვნებებთან ერთად მოვახდინოთ მანიპულაცია რეპოზიტორიაზე და შეთანხმებულად ვიმუშავოთ, ის რაც გვაზიარებინებს ერთმანეთში ჩვენს ნამუშევრებს. 

// github კი არის პლატფორმა და უბრალოდ გამოიყენება ამ ვიზუალური შედეგის ნახვისთვის.

// commit არის გაგზავნა, იგივე ატვირთვა როდესაც ჩვენ ვანახლებთ ჩვენს ნაშრომს ან ვტვირტთავთ მას პირველად.

// main branch არის მტავარი ბრენჩი ანუ user, სადაც ინახება ისტორია მთავარი ნამუშევრისა და მისი ვერსიებს შესახებ.

// სხვა branch კი არის სხვა user-ბის ბრენჩები, ანუ მეორედხარისხოვნები რომელიც უკეთებენ ამჟამინდელ და მთავარ ვერსიას მოდერნიზაციას.

// pull request - მოთხოვნის მიღება მოდერნიზაციაზე.