
// 1) რა არის state React ში და რითი განსხვავდება იგი props გან?

// state react-შ ნიშნავს მდგომარეობას, იგი ჩვეულებრივი props-ისგან გახნსვავდება სინტაქსით და რა თქმა უნდა გაფართოებული ფუნქციონალით, რომელიც საშუალებას გვაძლევს შევუცვალოთ ელემენტს state ანუ მდგომარეობა და მერე render გავაკეთოთ, ანუ დავარენდეროთ

// 2) რა არის useState? რატომ ვიყენებთ/ რა პრობლემას აგვარებს?

// useState არის react hook, რომელიც გამოიყენება ელემენტებისთვის state-ის ანუ მდგომარეობის შეცვლისთვის, ძალიან დიდი როლი აქვს react-ში და აგვრებს მომხარებლის ეკრანზე მდგომარეობის ცვლილებაზე და ელემენტის render-ზე, შედეგის განახლებაზე

// 3) რას აბრუნებს useState ფუნქცია?

// useState ფუნქცია აბრუნებს სიას, რომელშიც შეგვიძლია ვნახოთ ამჟამინდელი ელემენტის მდგომარეობა, ანუ რა მნიშნელობისაა და რას მოიცავს, და ფუნქცია, რომელიც გვეხმარება მისი მდგომარეობის შეცვლაში და მნიშვნელობის განახლებაში 

// 4) რატომ არ უნდა შევცვალოთ state პირდაპირ? (მაგ. count++)

// რადგან იგი პირდაპირ ზეგავლენას არ იქონიებს DOM-ზე. კი მნიშვნელობა შეიცვლება virtual dom-ში, მაგრამ dom-ში არანაირი ზემოქმედება არ მოხდება და არ განახლდება შესაბამისად.

// 5) რა ემართება კომპონენტს, როცა state იცვლება?

// render-დება, ანუ ხდება მნიშვნელობის განახლება.
